<?php

const LANG_ENGINE = [
    /* 00 */    'Запрос обрабатывался ~%.3f сек',
    /* 01 */    'Пинг (веб --> ВК) ~%.3f сек
Время ответа ~%.3f сек',
    /* 02 */    'Имя: BotEngineVK
Описание: Бот для ВК с открытым исходным кодом и модульной системой
Версия: '.ENGINE_VERSION.'
Автор: DeathScore13
URL: https://github.com/deathscore13/BotEngineVK',
    /* 03 */    'Использование:'.PHP_EOL,
    /* 04 */    'Модулей найдено %d:',
    /* 05 */    '⠀[%02d] "%s" (%s) от %s',
    /* 06 */    'Ошибка: ',
    /* 07 */    'недействительная цель: %d',
    /* 08 */    'код: %d; сообщение: %s',
    /* 09 */    'запрос: %d; код: %d; сообщение: %s',
    /* 10 */    'Модулей не найдено. Зачем вам вообще бот?',
    /* 11 */    'недействительный параметр: %d',
    /* 12 */    'Информация о модуле "%s":
Описание: %s
Версия: %s
Автор: %s
URL: %s
Путь: %s',
    /* 13 */    'Анализ уже использован, тупая ты башка',
    /* 14 */    'Произошла ошибка при отправке сообщения в ЛС.
Возможно, вы никогда не писали боту или заблокировали отправку сообщений. Пожалуйста, отправьте любое сообщение: vk.me/club'.
CFG_ENGINE['group_id'],
    /* 15 */    'Ответ отправлен в ЛС',
    /* 16 */    'отсутствует модуль: %s',
    /* 17 */    '%s <подкоманда> - %s',
    /* 18 */    '⠀%s %s- %s',
    /* 19 */    '%s %s- %s',
    /* 20 */    'Команд найдено %d:',
    /* 21 */    'Основные команды бота',
    /* 22 */    '[команда]',
    /* 23 */    'Анализ скорости',
    /* 24 */    'peer_id чата',
    /* 25 */    'Информация о боте',
    /* 26 */    '[номер]',
    /* 27 */    'Список модулей или информация об указанном модуле',
    /* 28 */    'Список команд',
    /* 29 */    'Без параметров',
    /* 30 */    'бот',
    /* 31 */    'анализ',
    /* 32 */    'пирид',
    /* 33 */    'инфо',
    /* 34 */    'модули',
    /* 35 */    'команды',
    /* 36 */    '[цель]',
];